In [73]:
%load_ext sql
%sql sqlite:///CourseData2.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @CourseData2.db'

In [74]:
%%sql
SELECT * 
FROM INSTRUCTOR
WHERE NAME LIKE '%Huntley%';

 * sqlite:///CourseData2.db
Done.

[(274, 'Christopher L.  Huntley')]

In [75]:
%%sql
SELECT COUNT(CatID) 
FROM CATALOG
WHERE Credits = '4 Credits' 
LIMIT 5;

 * sqlite:///CourseData2.db
Done.

[(55,)]

In [76]:
%%sql
SELECT COUNT(InID) 
FROM Instructor 
LIMIT 5;

 * sqlite:///CourseData2.db
Done.

[(1103,)]

In [77]:
%%sql 

SELECT (SUM(strftime('%s',End)-strftime('%s',Start))/60)/60 AS CourseHours, CRN, Location, Term
FROM Course_Meeting
WHERE LOCATION LIKE '%DSB%'
GROUP BY Location, Term
ORDER BY CourseHours DESC
LIMIT 10;

 * sqlite:///CourseData2.db
Done.

[(843, 74648, 'DSB 106', 'Fall2018'),
 (837, 37397, 'DSB 111', 'Spring2016'),
 (833, 71437, 'DSB 112', 'Fall2014'),
 (816, 37510, 'DSB 105', 'Spring2019'),
 (816, 37042, 'DSB 110', 'Spring2016'),
 (796, 31297, 'DSB 111', 'Spring2017'),
 (792, 31427, 'DSB 109', 'Spring2017'),
 (790, 75222, 'DSB 112', 'Fall2015'),
 (775, 37271, 'DSB 114', 'Spring2016'),
 (757, 70070, 'DSB 110B', 'Fall2014')]

In [78]:
%%sql
SELECT COUNT(InID) AS CoursesTaught, InID, Term
FROM SECTION
GROUP BY InID, Term
ORDER BY CoursesTaught DESC
LIMIT 10;

 * sqlite:///CourseData2.db
Done.

[(54, 730, 'Fall2017'),
 (54, 730, 'Fall2018'),
 (51, 730, 'Fall2016'),
 (50, 245, 'Fall2015'),
 (46, 245, 'Fall2014'),
 (32, 173, 'Fall2017'),
 (32, 173, 'Spring2016'),
 (31, 173, 'Fall2015'),
 (31, 173, 'Fall2016'),
 (31, 173, 'Spring2017')]

In [79]:
%%sql
SELECT * 
FROM Instructor 
Where InID = '730';

 * sqlite:///CourseData2.db
Done.

[(730, 'Nicole Elizabeth  Heller')]

In [80]:
%%sql 
SELECT InID, Term, Name, Count(Name) AS CoursesTaught
FROM Instructor
    JOIN SECTION USING (InID)
GROUP BY InID, Term
ORDER BY CoursesTaught ASC
LIMIT 10;

 * sqlite:///CourseData2.db
Done.

[(1, 'Summer2017', 'Michael P.  Coyne', 1),
 (1, 'Summer2018', 'Michael P.  Coyne', 1),
 (6, 'Spring2015', 'Scott M  Brenner', 1),
 (6, 'Spring2016', 'Scott M  Brenner', 1),
 (6, 'Spring2017', 'Scott M  Brenner', 1),
 (6, 'Spring2018', 'Scott M  Brenner', 1),
 (7, 'Fall2014', 'Kevin C.  Cassidy', 1),
 (7, 'Spring2016', 'Kevin C.  Cassidy', 1),
 (10, 'Fall2015', 'Stephen E.  Yost', 1),
 (10, 'Fall2016', 'Stephen E.  Yost', 1)]

In [81]:
%%sql 
SELECT AVG(CAP) as AverageCapacity
FROM SECTION 
WHERE CAP>10;

 * sqlite:///CourseData2.db
Done.

[(22.875,)]

In [82]:
# Huntley

In [85]:
%%sql 
SELECT CatID, Title, Name, COUNT(InID) AS TimesTaught
FROM Catalog
    JOIN SECTION USING (CatID)
    JOIN INSTRUCTOR USING (InID)
WHERE NAME LIKE "%Huntley%"
GROUP BY CatID
ORDER BY TimesTaught DESC;

 * sqlite:///CourseData2.db
Done.

[('OM 0101', 'Operations Management', 'Christopher L.  Huntley', 7),
 ('IS 0240', 'Systems Analysis and Logical Design', 'Christopher L.  Huntley', 4),
 ('IS 0320', 'Systems Design and Implementation', 'Christopher L.  Huntley', 4),
 ('IS 0100', 'Introduction to Information Systems', 'Christopher L.  Huntley', 3),
 ('IS 0135', 'Fundamentals of Web Design', 'Christopher L.  Huntley', 3),
 ('IS 0399', 'Independent Study', 'Christopher L.  Huntley', 3),
 ('IS 0260', 'Database Systems', 'Christopher L.  Huntley', 1),
 ('IS 0505', 'Python for Business Analytics', 'Christopher L.  Huntley', 1),
 ('IS 0510', 'Databases for Business Analytics', 'Christopher L.  Huntley', 1),
 ('IS 0585', 'Contemporary Topics in Information Systems and Operations Management', 'Christopher L.  Huntley', 1)]

In [86]:
%%sql 
SELECT TERM, Name, CatID
FROM SECTION 
    JOIN INSTRUCTOR USING (InID)
    JOIN CATALOG USING (CatID)
WHERE NAME LIKE '%Huntley'AND CatID = "IS 0100";

 * sqlite:///CourseData2.db
Done.

[('Fall2014', 'Christopher L.  Huntley', 'IS 0100'),
 ('Fall2015', 'Christopher L.  Huntley', 'IS 0100'),
 ('Fall2015', 'Christopher L.  Huntley', 'IS 0100')]

In [87]:
%%sql 
SELECT Name, ((SUM(strftime('%s',End)-strftime('%s',Start)))/60)/60 AS CourseHours, Term
FROM Course_Meeting
    JOIN SECTION USING (CRN, Term)
    JOIN INSTRUCTOR USING (InID)
    JOIN Catalog USING (CatID)
WHERE NAME LIKE "%Huntley%"
GROUP BY Term
ORDER BY CourseHours DESC;

 * sqlite:///CourseData2.db
Done.

[('Christopher L.  Huntley', 223, 'Fall2017'),
 ('Christopher L.  Huntley', 130, 'Fall2015'),
 ('Christopher L.  Huntley', 118, 'Spring2016'),
 ('Christopher L.  Huntley', 102, 'Spring2017'),
 ('Christopher L.  Huntley', 102, 'Spring2018'),
 ('Christopher L.  Huntley', 97, 'Fall2014'),
 ('Christopher L.  Huntley', 70, 'Fall2018'),
 ('Christopher L.  Huntley', 65, 'Fall2016'),
 ('Christopher L.  Huntley', 62, 'Spring2019')]

In [89]:
%%sql 
SELECT Name, Term, CRN, CatID
FROM Catalog
    JOIN SECTION USING (CatID)
    JOIN INSTRUCTOR USING (InID)
WHERE NAME LIKE "%Huntley%" AND Term = "Fall2017";

 * sqlite:///CourseData2.db
Done.

[('Christopher L.  Huntley', 'Fall2017', 71153, 'IS 0240'),
 ('Christopher L.  Huntley', 'Fall2017', 73088, 'IS 0399'),
 ('Christopher L.  Huntley', 'Fall2017', 72913, 'IS 0505'),
 ('Christopher L.  Huntley', 'Fall2017', 72914, 'IS 0510')]

In [90]:
%%sql 
SELECT Name, Location, COUNT(Location) AS NumClassMeetings
FROM Course_Meeting
    JOIN SECTION USING (CRN, Term)
    JOIN INSTRUCTOR USING (InID)
    JOIN Catalog USING (CatID)
WHERE NAME LIKE "%Huntley%"
GROUP BY Location
ORDER BY NumClassMeetings DESC;

 * sqlite:///CourseData2.db
Done.

[('Christopher L.  Huntley', 'DSB 106', 108),
 ('Christopher L.  Huntley', 'DSB 110B', 105),
 ('Christopher L.  Huntley', 'DSB 109', 66),
 ('Christopher L.  Huntley', 'DSB 115', 59),
 ('Christopher L.  Huntley', 'DSB 114', 52),
 ('Christopher L.  Huntley', 'DSB 108', 29),
 ('Christopher L.  Huntley', 'DSB 111', 28),
 ('Christopher L.  Huntley', 'DSB 112', 27),
 ('Christopher L.  Huntley', 'DSB 107', 26),
 ('Christopher L.  Huntley', 'DSB 110A', 26),
 ('Christopher L.  Huntley', 'DSB 104', 14),
 ('Christopher L.  Huntley', 'DSB 2109A', 14)]

In [91]:
%%sql 
SELECT ((SUM(strftime('%s',End)-strftime('%s',Start)))/60)/60 AS CourseHours, Day
FROM Course_Meeting
WHERE DAY <> 'day'
GROUP BY Day
ORDER BY CourseHours DESC;

 * sqlite:///CourseData2.db
Done.

[(116562, 'T'),
 (111245, 'R'),
 (108106, 'M'),
 (96924, 'W'),
 (68230, 'F'),
 (7143, 'S'),
 (956, 'U')]

In [92]:
%%sql 
SELECT ((SUM(strftime('%s',End)-strftime('%s',Start)))/60)/60 AS CourseHours, Day, Name
FROM Course_Meeting
    JOIN SECTION USING (CRN, Term)
    JOIN Instructor USING (InID)
WHERE DAY <> 'day'AND Name LIKE '%Huntley%'
GROUP BY Day
ORDER BY CourseHours DESC;

 * sqlite:///CourseData2.db
Done.

[(339, 'T', 'Christopher L.  Huntley'),
 (336, 'W', 'Christopher L.  Huntley'),
 (183, 'R', 'Christopher L.  Huntley'),
 (173, 'M', 'Christopher L.  Huntley'),
 (93, 'S', 'Christopher L.  Huntley'),
 (83, 'F', 'Christopher L.  Huntley')]